In [1]:
billionaires = {
    "name" : ["Elon Musk", 'Jeff Bezos', 'Bill Gates'],
    "company" : ["SpaceX", 'Amazon', 'Microsoft'],
    "net_worth" : ["218.6 billion USD", '132.8 billion USD', '125.2 billion USD']
}

In [2]:
import pandas as pd            # importing pandas

In [3]:
df = pd.DataFrame(billionaires)       # loading DataFramne

In [4]:
df                    # printing DataFrame

         name    company          net_worth
0   Elon Musk     SpaceX  218.6 billion USD
1  Jeff Bezos     Amazon  132.8 billion USD
2  Bill Gates  Microsoft  125.2 billion USD

In [5]:
df['company']             # display company names

0       SpaceX
1       Amazon
2    Microsoft
Name: company, dtype: object

In [7]:
df.set_index('company', inplace=True)          # permanently set company column as index

In [8]:
df       # again printing dataframe

                 name          net_worth
company
SpaceX      Elon Musk  218.6 billion USD
Amazon     Jeff Bezos  132.8 billion USD
Microsoft  Bill Gates  125.2 billion USD

In [9]:
df.index            # check new indexes which we just set in previous cell

Index(['SpaceX', 'Amazon', 'Microsoft'], dtype='object', name='company')

In [17]:
df.loc['Amazon']      # see the information of Amazon

name                Jeff Bezos
net_worth    132.8 billion USD
Name: Amazon, dtype: object

In [18]:
df.loc['Amazon', 'name']          # get the name of a person owned Amazon

'Jeff Bezos'

In [20]:
df.iloc[0]         # still access using integer based location

name                 Elon Musk
net_worth    218.6 billion USD
Name: SpaceX, dtype: object

In [22]:
df.reset_index(inplace=True)        # resetting the index to its original form
df           # printing

   index    company        name          net_worth
0      0     SpaceX   Elon Musk  218.6 billion USD
1      1     Amazon  Jeff Bezos  132.8 billion USD
2      2  Microsoft  Bill Gates  125.2 billion USD